/** 
 * Выполните поразрядные операции, операцию логического сравнения и выведите результаты:
 * 12 ИЛИ 5, 8 ИЛИ 7, 24 ИЛИ 64
 * 27 И 3, 16 И 0, 32 И 1
 * 5 искл. ИЛИ 6, 5 искл. ИЛИ 5, 8 искл. ИЛИ 0
 * 6 НЕ РАВНЯЕТСЯ 1, 1 НЕ РАВНЯЕТСЯ 1, 0 НЕ РАВНЯЕТСЯ 0
 */
#include <stdio.h>

void or(void) {
    printf("Битовая операция ИЛИ\n");

    printf("12 OR 5 = %d   \n", 12 | 5);   // 12 = 1100;   5 = 0101;       1100 | 0101 <=> 1101 = 13 
    printf("8 OR 7 = %d    \n", 8 | 7);    //  8 = 1000;   7 = 0111;       1000 | 0111 <=> 1111 = 15
    printf("24 OR 64 = %d  \n", 24 | 64);  // 24 = 11000; 64 = 1000000;   11000 | 1000000 <=> 1011000 = 88

    printf("\n");
}

void and(void) {
    printf("Битовая операция И\n");

    printf("27 AND 3 = %d     \n", 27 & 3);   // 27 = 11011; 3 = 00011; 11011 & 00011 <=> 00011 = 3
    printf("16 AND 0 = %d     \n", 16 & 0);   // 16 = 10000; 0 = 00000; 10000 & 00000 <=> 00000 = 0
    printf("31 AND 1 = %d     \n", 31 & 1);   // 31 = 11111; 1 = 00001; 11111 & 00001 <=> 00001 = 1

    printf("\n");
}

void xor(void) {
    printf("Битовая операция ИСК. ИЛИ \n");

    printf("5 XOR 6 = %d     \n", 5 ^ 6);   // 5 = 101; 6 = 110; 101 ^ 110 <=> 011 = 3
    printf("5 XOR 5 = %d     \n", 5 ^ 5);   // 5 = 101; 5 = 101; 101 ^ 101 <=> 000 = 0
    printf("8 XOR 0 = %d     \n", 8 ^ 0);   // 8 = 1000; 0 = 0000; 1000 ^ 0000 <=> 1000 = 8

    printf("\n");
}

void not(void) {
    printf("Сравнение\n");

    printf("6 != 1 = %d     \n", 6 != 1);   // 6 не равна 1 - истина (1)
    printf("1 != 1 = %d     \n", 1 != 1);   // 1 не равен 1 - ложь(0)
    printf("0 != 0 = %d     \n", 0 != 0);   // 0 не равен 0 - ложь(0)

    printf("\n");
}

int main()
{
    or();
    and();
    xor();
    not();
    return 0;
}

